Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnZeroHeightError Property
 The column can't have zero height
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnZeroHeightError { get; }
Public Shared ReadOnly Property ColumnZeroHeightError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnZeroHeightError {
	FailureDefinitionId^ get ();
}
static member ColumnZeroHeightError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace